app/Http/Livewire/Member/Dashboard.php

  public function render()
  {
    $this->availableActive = auth()->user()->active_income ? auth()->user()->active_income->sum('credit') - auth()->user()->active_income->sum('debit') : 0;
    return view('livewire.member.dashboard', [
      'entrant' => User::select(DB::raw("*, LENGTH(REPLACE(network, '" . $this->user . "', '')) - LENGTH(REPLACE(REPLACE(network, '" . $this->user . "', ''), '.', '')) + 1 level"))->with('contract')->where('network', 'like', $this->user . '%')->whereRaw("LENGTH(REPLACE(network, '" . $this->user . "', '')) - LENGTH(REPLACE(REPLACE(network, '" . $this->user . "', ''), '.', '')) < 5")->get(),
      'bonus' => auth()->user()->benefit_available ? auth()->user()->benefit_available->sum('amount') : 0,
      'active' => auth()->user()->active_income,
      'contract' => auth()->user()->contract_remaining ? auth()->user()->contract_remaining->amountActive : 0,
      'history' => auth()->user()->withdrawal_all,
      'menu' => 'dashboard',
    ])->extends('layouts.default');
---
SELECT * FROM `bonus` WHERE `bonus`.`user_id` = 2 and `bonus`.`user_id` IS not NULL and `withdrawal_id` IS NULL and `bonus`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `contract` WHERE `contract`.`id` in (1, 2, 3)
SELECT *, LENGTH(REPLACE(network, '2.', '')) - LENGTH(REPLACE(REPLACE(network, '2.', ''), '.', '')) + 1 level FROM `user` WHERE `network` like '2.%' and LENGTH(REPLACE(network, '2.', '')) - LENGTH(REPLACE(REPLACE(network, '2.', ''), '.', '')) < 5 and `user`.`deleted_at` IS NULL