app/Models/User.php

SELECT * FROM `contract` WHERE `contract`.`id` = 6 LIMIT 1
---
  public function getContractValueAttribute()
  {
    return $this->contract()->first()->name . ' - $ ' . number_format($this->contract()->first()->value);

SELECT sum(`debit`) as aggregate FROM `bonus` WHERE `bonus`.`user_id` = 2 and `bonus`.`user_id` IS not NULL and `bonus`.`deleted_at` IS NULL
---
  public function getAvailableContractAttribute()
  {
    return $this->contract()->first()->benefit - $this->bonus()->sum('debit');

SELECT sum(`credit`) as aggregate FROM `bonus` WHERE `bonus`.`user_id` = 2 and `bonus`.`user_id` IS not NULL and `bonus`.`deleted_at` IS NULL
---
  public function getAvailableBonusAttribute()
  {
    return $this->bonus()->sum('credit') - $this->bonus()->sum('debit');

SELECT sum(`credit`) as aggregate FROM `pin` WHERE `pin`.`user_id` = 2 and `pin`.`user_id` IS not NULL
---
  public function getAvailablePinAttribute()
  {
    return $this->pin()->sum('credit') - $this->pin()->sum('debit');

SELECT * FROM `contract` WHERE `contract`.`id` in (1, 2, 3)
SELECT *, LENGTH(REPLACE(network, '2.', '')) - LENGTH(REPLACE(REPLACE(network, '2.', ''), '.', '')) + 1 level FROM `user` WHERE `network` like '2.%' and LENGTH(REPLACE(network, '2.', '')) - LENGTH(REPLACE(REPLACE(network, '2.', ''), '.', '')) < 5 and `user`.`deleted_at` IS NULL
---
  public function getDownlineAttribute()
  {
    $user = auth()->user()->network . auth()->id() . '.';
    return $this->selectRaw("*, LENGTH(REPLACE(network, '" . $user . "', '')) - LENGTH(REPLACE(REPLACE(network, '" . $user . "', ''), '.', '')) + 1 level")->with('contract')->where('network', 'like', $user . '%')->whereRaw("LENGTH(REPLACE(network, '" . $user . "', '')) - LENGTH(REPLACE(REPLACE(network, '" . $user . "', ''), '.', '')) < 5")->get();